## 빅데이터 기반 AI 응용 솔루션 개발자 전문과정

### 교과목명 : 선형대수학 및 통계학
- 평가일 : 21.8.2
- 성명 : 조경림 
- 점수 :

Q1. 표준 정규분포의 확률밀도함수를 그래프로 표현하세요.  
x축은 np.arange(-3,3,0.1)

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

ModuleNotFoundError: No module named 'numpy'

Q2. 표준 정규분포의 누적분포함수를 그래프로 표현하세요.  
x축 : np.arange(-3,3,0.1)

Q3. "dataset/5_2_fm.csv"을 df1으로 불러와서 다음사항을 수행하세요.
- df1을 df2 이름으로 복사한 후 df2의 species의 A, B를 B, A로 변경하세요.
- df2의 length를 species가 A인 것은 2배로 B인 것은 3배로 변경하여 df1과 df2를 행방향으로 결합, df 생성 
- df를 species 칼럼을 기준으로 그룹별 평균과 표준편차를 산출

In [13]:
df1 = pd.read_csv('dataset/5_2_fm.csv')

Q4.평균 4, 표준편차 0.8인 정규분포에서 아래작업을 수행하세요.
- 확률밀도함수에서 x 값이 3 이하가 되는 비율을 구하세요
- 누적분포함수에서 확률변수가 4 이하가 되는 확률을 구하세요

Q5. x축이 x = np.arange(start = -5, stop = 5.1, step = 0.01)이라고 할 때 다음을
수행하세요.
- 표준정규분포 그래프
- 자유도 9인 t분포 그래프
- 자유도 5인 t분포 그래프

Q6. 'dataset/titanic3.csv'을 불러와서 sex 와 embarked 칼럼을 각각 인덱스, 컬럼으로 하고 values는 survived, 함수는 mean을 적용하여 pivot_table을 만든 후 히트맵으로 시각화 및 인사이트를 기술하세요. (단 embarked 컬럼의 null 값을 앞에 있는 값으로 대체 처리 선행)

In [44]:
titanic = pd.read_csv('dataset/titanic3.csv')
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

Q7. 주어진 3행 3열 배열의 역행렬을 구하고 검증하세요. (검증은 항등행렬을 출력)

In [49]:
np.random.seed(0)
mt1 = np.random.randint(1,4,size=(3,3))
mt1

array([[1, 2, 1],
       [2, 2, 3],
       [1, 3, 1]])

Q8. Q. fish_multi 데이터프레임으로 다음을 수행하세요.
- A, B 두개의 그룹의 Box Plot을 그리고 이상치를 구하세요.
- 이상치를 제거한 후 Box Plot으로 이상치 여부를 확인하세요.
- 바이올린 플롯을 표현하세요.

In [84]:
import pandas as pd
fish_multi = pd.read_csv("dataset/4_fm2.csv")
fish_multi.iloc[5,1] = 12
fish_multi.iloc[10,1] = 12
fish_multi.iloc[12,1] = 1
print(fish_multi)

   species  length
0        A       2
1        A       3
2        A       3
3        A       4
4        A       4
5        A      12
6        A       4
7        A       5
8        A       5
9        A       6
10       B      12
11       B       6
12       B       1
13       B       7
14       B       7
15       B       7
16       B       7
17       B       8
18       B       8
19       B       9

Q9. df_auto mpg 컬럼과 horsepower 컬럼에 대하여 산점도, 회귀선, 히스토그램을 
하나의 그래프로 표현하여 탐색 후 인사이트를 기술하세요.

In [88]:
import pandas as pd
df_auto = pd.read_excel('dataset/auto-mpg.xlsx')
df_auto.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

Q10. FIFA 데이터셋을 불러와서 다음 사항을 수행하세요.
- 각 선수의 키는 Height변수에 피트와 인치로 입력되어 있습니다. 
이를 cm로 변환하여 새로운 변수 Height_cm을 생성하고 통계요약표를 구하세요
( “ ' ” 앞의 숫자는 피트이며, “ ' ” 뒤의 숫자는 인치, 1피트 = 30cm, 1인치 = 2.5cm)
- 포지션을 의미하는 Position변수를 아래 표를 참고하여 “Forward”, “Midfielder”,“Defender”, “GoalKeeper”로 재범주화하고, 변환하여 Position_Class 라는 변수를 생성하고 각 그룹별 평균을 구하세요.
    - Forward : ['LS','ST','RS','LW','LF','CF','RF','RW']
    - Midfielder : ['LAM','CAM','RAM','LM','LCM','CM','RCM','RM']
    - Defender : ['LBW','LDM','CDM','RDM','RWB','LB','LCB','CB','RCB','RB']
    - GoalKeeper

In [73]:
import pandas as pd
import numpy as np

data = pd.read_csv('./dataset/FIFA.csv',engine='python')
data.head()

,ID,Name,Age,Nationality,Overall,Club,Preferred_Foot,Work_Rate,Position,Jersey_Number,Contract_Valid_Until,Height,Weight_lb,Release_Clause,Value,Wage
0,158023,L. Messi,31,Argentina,94,FC Barcelona,Left,Medium/ Medium,RF,10,2021,5'7,159,226500,110500,565
1,20801,Cristiano Ronaldo,33,Portugal,94,Juventus,Right,High/ Low,ST,7,2022,6'2,183,127100,77000,405
2,190871,Neymar Jr,26,Brazil,92,Paris Saint-Germain,Right,High/ Medium,LW,10,2022,5'9,150,228100,118500,290
3,193080,De Gea,27,Spain,91,Manchester United,Right,Medium/ Medium,GK,1,2020,6'4,168,138600,72000,260
4,192985,K. De Bruyne,27,Belgium,91,Manchester City,Right,High/ High,RCM,7,2023,5'11,154,196400,102000,355